SoapCalculor/src/main/resources/add.vm

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:Add>              
          <tem:intA>${headers.val1}</tem:intA>
         <tem:intB>${headers.val2}</tem:intB>
      </tem:Add>
   </soapenv:Body>
</soapenv:Envelope>