src/test/resources/requestExample.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <Add xmlns="http://tempuri.org/">
            <intA>2</intA>
            <intB>2</intB>
        </Add>
    </soap:Body>
</soap:Envelope>